In [ ]:
#Pandas : Series & Dataframe

In [2]:
import pandas as pd
a = ['a','b','c','d'] #natural index ##S of series should be capital
ps1 = pd.Series(a)
ps1

0    a
1    b
2    c
3    d
dtype: object

In [5]:
b = {'a': 12, 'b': 34, 'c': 56} #given indexing ##S of series should be capital ###curly brackets would used
ps2 = pd.Series(b) 
ps2

a    12
b    34
c    56
dtype: int64

In [ ]:
# Create Dummy Dataframe : using Python Dict

In [10]:
my_data = {
   'Name': ['Alexa', 'Bixby', 'Cortana', 'Jarvis', 'Lyra', 'Robin', 'Siri'],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female'], 
    'Education': ['Postgraduate', 'Graduate', 'Postgraduate', 'Doctorate', 'Graduate', 'Graduate', 'Postgraduate'], 
    'Age': [24, 21, 25, 28, 23, 22, 24], 
    'Monthly_Salary': [27000, 25000, 30000, 35000, 26000, 24000, 28000]
    }
my_df = pd.DataFrame(my_data) #D and F of DataFrame should be capital ## data added in curly brackets 
my_df

      Name  Gender     Education  Age  Monthly_Salary
0    Alexa  Female  Postgraduate   24           27000
1    Bixby    Male      Graduate   21           25000
2  Cortana  Female  Postgraduate   25           30000
3   Jarvis    Male     Doctorate   28           35000
4     Lyra  Female      Graduate   23           26000
5    Robin    Male      Graduate   22           24000
6     Siri  Female  Postgraduate   24           28000

In [ ]:
 #Reshape Dataframe : Sort, Subset, Filter, Group, Melt, Pivot

In [11]:
my_df.columns

Index(['Name', 'Gender', 'Education', 'Age', 'Monthly_Salary'], dtype='object')

In [12]:
my_df.index

RangeIndex(start=0, stop=7, step=1)

In [ ]:
# Sort Dataframe

In [15]:
my_df.sort_values('Age') # Sort Values by Specific Column in Ascending Order (by Default)

      Name  Gender     Education  Age  Monthly_Salary
1    Bixby    Male      Graduate   21           25000
5    Robin    Male      Graduate   22           24000
4     Lyra  Female      Graduate   23           26000
0    Alexa  Female  Postgraduate   24           27000
6     Siri  Female  Postgraduate   24           28000
2  Cortana  Female  Postgraduate   25           30000
3   Jarvis    Male     Doctorate   28           35000

In [20]:
my_df.sort_values(['Age', 'Monthly_Salary'], ascending =[True,False])

      Name  Gender     Education  Age  Monthly_Salary
1    Bixby    Male      Graduate   21           25000
5    Robin    Male      Graduate   22           24000
4     Lyra  Female      Graduate   23           26000
6     Siri  Female  Postgraduate   24           28000
0    Alexa  Female  Postgraduate   24           27000
2  Cortana  Female  Postgraduate   25           30000
3   Jarvis    Male     Doctorate   28           35000

In [21]:
my_df['Name']

0      Alexa
1      Bixby
2    Cortana
3     Jarvis
4       Lyra
5      Robin
6       Siri
Name: Name, dtype: object

In [ ]:
# Subset Dataframe

In [24]:
my_df[['Name', 'Education', 'Age']] #double brackets for extracting data from multiple columns

      Name     Education  Age
0    Alexa  Postgraduate   24
1    Bixby      Graduate   21
2  Cortana  Postgraduate   25
3   Jarvis     Doctorate   28
4     Lyra      Graduate   23
5    Robin      Graduate   22
6     Siri  Postgraduate   24

In [25]:
my_df.iloc[1]

Name                 Bixby
Gender                Male
Education         Graduate
Age                     21
Monthly_Salary       25000
Name: 1, dtype: object

In [26]:
my_df.iloc[2]

Name                   Cortana
Gender                  Female
Education         Postgraduate
Age                         25
Monthly_Salary           30000
Name: 2, dtype: object

In [37]:
my_df.loc[0, 'Age']

24

In [ ]:
# Filter Dataframe

In [32]:
my_df[my_df['Gender']=='Female']

      Name  Gender     Education  Age  Monthly_Salary
0    Alexa  Female  Postgraduate   24           27000
2  Cortana  Female  Postgraduate   25           30000
4     Lyra  Female      Graduate   23           26000
6     Siri  Female  Postgraduate   24           28000

In [33]:
my_df[my_df['Education']=='Postgraduate']

      Name  Gender     Education  Age  Monthly_Salary
0    Alexa  Female  Postgraduate   24           27000
2  Cortana  Female  Postgraduate   25           30000
6     Siri  Female  Postgraduate   24           28000

In [34]:
my_df[my_df['Gender']=='Male']

     Name Gender  Education  Age  Monthly_Salary
1   Bixby   Male   Graduate   21           25000
3  Jarvis   Male  Doctorate   28           35000
5   Robin   Male   Graduate   22           24000

In [40]:
my_df[(my_df['Age']<25) & (my_df['Education']=='Graduate')]

    Name  Gender Education  Age  Monthly_Salary
1  Bixby    Male  Graduate   21           25000
4   Lyra  Female  Graduate   23           26000
5  Robin    Male  Graduate   22           24000

In [49]:
my_df[(my_df['Age'] > 25) & (my_df['Education']=='Doctorate')]

     Name Gender  Education  Age  Monthly_Salary
3  Jarvis   Male  Doctorate   28           35000

In [ ]:
# Group Dataframe

In [50]:
my_df.groupby('Education')['Monthly_Salary'].mean()

Education
Doctorate       35000.000000
Graduate        25000.000000
Postgraduate    28333.333333
Name: Monthly_Salary, dtype: float64

In [51]:
my_df_pivot = pd.pivot_table(my_df, index='Gender', columns='Education', values='Age', aggfunc='median')
my_df_pivot

Education  Doctorate  Graduate  Postgraduate
Gender
Female           NaN      23.0          24.0
Male            28.0      21.5           NaN

In [52]:
panel_data = {
    'Company': ['ABC', 'ABC', 'DEF', 'DEF', 'GHI', 'GHI'],
    'Year': [2001, 2002, 2001, 2002, 2001, 2002],
    'Revenue': [1234, 2345, 3456, 4567, 5678, 6789]
    }
panel_df = pd.DataFrame(panel_data)
panel_df

  Company  Year  Revenue
0     ABC  2001     1234
1     ABC  2002     2345
2     DEF  2001     3456
3     DEF  2002     4567
4     GHI  2001     5678
5     GHI  2002     6789

In [69]:
panel_pdf_pivot = pd.pivot(panel_df, index='Company', columns='Year', values='Revenue') 
panel_pdf_pivot #s in cloumns and vlaues is important

Year     2001  2002
Company
ABC      1234  2345
DEF      3456  4567
GHI      5678  6789

In [70]:
panel_pdf_pivot.reset_index(level='Company', inplace=True)
panel_pdf_pivot

Year Company  2001  2002
0        ABC  1234  2345
1        DEF  3456  4567
2        GHI  5678  6789

In [68]:
panel_pdf_pivot_melt =  pd.melt(panel_pdf_pivot, id_vars=['Company'], value_name='Revenue')
panel_pdf_pivot_melt #nhi aaya smjh

  Company  Year  Revenue
0     ABC  2001     1234
1     DEF  2001     3456
2     GHI  2001     5678
3     ABC  2002     2345
4     DEF  2002     4567
5     GHI  2002     6789

In [71]:
my_df_f = my_df[my_df['Gender']=='Female']
my_df_f

      Name  Gender     Education  Age  Monthly_Salary
0    Alexa  Female  Postgraduate   24           27000
2  Cortana  Female  Postgraduate   25           30000
4     Lyra  Female      Graduate   23           26000
6     Siri  Female  Postgraduate   24           28000

In [74]:
my_df_m = my_df[my_df['Gender']!='Female']
my_df_m

     Name Gender  Education  Age  Monthly_Salary
1   Bixby   Male   Graduate   21           25000
3  Jarvis   Male  Doctorate   28           35000
5   Robin   Male   Graduate   22           24000

In [75]:
my_df_m = pd.concat([my_df_m,my_df_f], ignore_index=True)
my_df_m

      Name  Gender     Education  Age  Monthly_Salary
0    Bixby    Male      Graduate   21           25000
1   Jarvis    Male     Doctorate   28           35000
2    Robin    Male      Graduate   22           24000
3    Alexa  Female  Postgraduate   24           27000
4  Cortana  Female  Postgraduate   25           30000
5     Lyra  Female      Graduate   23           26000
6     Siri  Female  Postgraduate   24           28000

In [76]:
my_df_merged_left = pd.merge(my_df_f[['Education', 'Age']], my_df_m[['Education', 'Monthly_Salary']], on='Education', how='left')
my_df_merged_left

       Education  Age  Monthly_Salary
0   Postgraduate   24           27000
1   Postgraduate   24           30000
2   Postgraduate   24           28000
3   Postgraduate   25           27000
4   Postgraduate   25           30000
5   Postgraduate   25           28000
6       Graduate   23           25000
7       Graduate   23           24000
8       Graduate   23           26000
9   Postgraduate   24           27000
10  Postgraduate   24           30000
11  Postgraduate   24           28000

In [77]:
my_df_merged_inner = pd.merge(my_df_f[['Education', 'Age']], my_df_m[['Education', 'Monthly_Salary']], on='Education', how='inner')
my_df_merged_inner

       Education  Age  Monthly_Salary
0   Postgraduate   24           27000
1   Postgraduate   24           30000
2   Postgraduate   24           28000
3   Postgraduate   25           27000
4   Postgraduate   25           30000
5   Postgraduate   25           28000
6   Postgraduate   24           27000
7   Postgraduate   24           30000
8   Postgraduate   24           28000
9       Graduate   23           25000
10      Graduate   23           24000
11      Graduate   23           26000

In [78]:
my_df.head(n=5)

      Name  Gender     Education  Age  Monthly_Salary
0    Alexa  Female  Postgraduate   24           27000
1    Bixby    Male      Graduate   21           25000
2  Cortana  Female  Postgraduate   25           30000
3   Jarvis    Male     Doctorate   28           35000
4     Lyra  Female      Graduate   23           26000

In [79]:
my_df.tail(n=5)

      Name  Gender     Education  Age  Monthly_Salary
2  Cortana  Female  Postgraduate   25           30000
3   Jarvis    Male     Doctorate   28           35000
4     Lyra  Female      Graduate   23           26000
5    Robin    Male      Graduate   22           24000
6     Siri  Female  Postgraduate   24           28000

In [80]:
my_df.shape

(7, 5)

In [82]:
my_df.info ()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   Gender          7 non-null      object
 2   Education       7 non-null      object
 3   Age             7 non-null      int64
 4   Monthly_Salary  7 non-null      int64
dtypes: int64(2), object(3)
memory usage: 408.0+ bytes

my_df.describe ()

In [83]:
my_df.describe()

             Age  Monthly_Salary
count   7.000000        7.000000
mean   23.857143    27857.142857
std     2.267787     3716.116765
min    21.000000    24000.000000
25%    22.500000    25500.000000
50%    24.000000    27000.000000
75%    24.500000    29000.000000
max    28.000000    35000.000000

In [85]:
my_df['Gender']=pd.Categorical(my_df['Gender'])
my_df['Gender']

0    Female
1      Male
2    Female
3      Male
4    Female
5      Male
6    Female
Name: Gender, dtype: category
Categories (2, object): ['Female', 'Male']

In [90]:
my_df['Education']=pd.Categorical(my_df['Education'], categories=ordered_category, ordered=True)
my_df['Education']

0    Postgraduate
1        Graduate
2    Postgraduate
3       Doctorate
4        Graduate
5        Graduate
6    Postgraduate
Name: Education, dtype: category
Categories (3, object): ['Graduate' < 'Postgraduate' < 'Doctorate']